IDEA Open Model
IdeaBeamImportSettings Properties
Compatible with IDEA StatiCa v 10.1
The IdeaBeamImportSettings type exposes the following members.
Properties
Name | Description
BeamFileName
 Gets or sets the name of the Beam project
CanChangeDesignCodeInWizard
 Can change design code in Wizard
DesignCode
 Gets or sets the Design Code
ExportAllLinearCombination
 All linear combination will be exported to IDEA connection
UserWizardBrand
 Set user Wizard Brand
UseWizard
 Open import wizard window
Top
See Also
Reference
IdeaBeamImportSettings Class
IdeaRS.OpenModel.Beam Namespace